'use client';

import React, { useEffect } from 'react';

import { TopLoadingBar } from '@/components/common/TopLoadingBar';
import useApi from '@/hooks/useApi';
import axios from 'axios';

const MainForm = () => {
  const getmedudhApi = useApi({
    key: ['udh-med'],
    method: 'GET',
    url: `medicine/udh-med`,
  })?.get;
  let interval: any;
  useEffect(() => {
  //   // Implementing the setInterval method
    // const allowedIp = 'localhost';
    // const currentIp = window.location.hostname;
    // console.log(currentIp);
    // if (currentIp === allowedIp) {
    // eslint-disable-next-line react-hooks/exhaustive-deps
    interval = setInterval(async () => {
      const respon = await axios.get(`${process.env.NEXT_PUBLIC_API_URL}/medicine/udh-med`)
      // getmedudhApi?.refetch();
      // window.location.reload();
      console.log(respon.status);
    }, 30000);
    // }
    // Clearing the interval
    return () => clearInterval(interval);
  }, [getmedudhApi]);
  // console.log(selectedA);
  return (

    <div>
      <TopLoadingBar isFetching={getmedudhApi?.isFetching || getmedudhApi?.isPending} />
      <div>
        <p className="flex justify-center text-2xl">
          ชีวิตอันว่างเปล่า
        </p>
        <p className="text-center">
          <div>
            บูระพารัสมิง พระพุทธะคุณัง
            บูระพารัสมิง พระธัมเมตัง
            บูระพารัสมิง พระสังฆานัง
            ทุกขะโรคะภะยัง วิวัญชัยเย สัพพะทุกข์ สัพพะโศก
            สัพพะโรค สัพพะภัย สัพพะเคราะห์ เสนียดจัญไร
            วิวัญชัยเย สัพพะธะนัง สัพพะลาภัง ภะวันตุเม
            รักขันตุ สุรักขันตุ
          </div>
          <br />
          <div>
            อาคะเนยรัสมิง พระพุทธะคุณัง
            อาคะเนยรัสมิง พระธัมเมตัง
            อาคะเนยรัสมิง พระสังฆานัง
            ทุกขะโรคะภะยัง วิวัญชัยเย สัพพะทุกข์ สัพพะโศก
            สัพพะโรค สัพพะภัย สัพพะเคราะห์ เสนียดจัญไร
            วิวัญชัยเย สัพพะธะนัง สัพพะลาภัง ภะวันตุเม
            รักขันตุ สุรักขันตุ
          </div>
          <br />
          <div>
            ทักษิณรัสมิง พระพุทธะคุณัง
            ทักษิณรัสมิง พระธัมเมตัง
            ทักษิณรัสมิง พระสังฆานัง
            ทุกขะโรคะภะยัง วิวัญชัยเย สัพพะทุกข์ สัพพะโศก
            สัพพะโรค สัพพะภัย สัพพะเคราะห์ เสนียดจัญไร
            วิวัญชัยเย สัพพะธะนัง สัพพะลาภัง ภะวันตุเม
            รักขันตุ สุรักขันตุ
          </div>
          <br />
          <div>
            {' '}
            หรดีรัสมิง พระพุทธะคุณัง
            หรดีรัสมิง พระธัมเมตัง
            หรดีรัสมิง พระสังฆานัง
            ทุกขะโรคะภะยัง วิวัญชัยเย สัพพะทุกข์ สัพพะโศก
            สัพพะโรค สัพพะภัย สัพพะเคราะห์ เสนียดจัญไร
            วิวัญชัยเย สัพพะธะนัง สัพพะลาภัง ภะวันตุเม
            รักขันตุ สุรักขันตุ
          </div>
          <br />
          <div>
            ปัจจิมรัสมิง พระพุทธะคุณัง
            ปัจจิมรัสมิง พระธัมเมตัง
            ปัจจิมรัสมิง พระสังฆานัง
            ทุกขะโรคะภะยัง วิวัญชัยเย สัพพะทุกข์ สัพพะโศก
            สัพพะโรค สัพพะภัย สัพพะเคราะห์ เสนียดจัญไร
            วิวัญชัยเย สัพพะธะนัง สัพพะลาภัง ภะวันตุเม
            รักขันตุ สุรักขันตุ
          </div>
          <br />
          <div>
            พายัพรัสมิง พระพุทธะคุณัง
            พายัพรัสมิง พระธัมเมตัง
            พายัพรัสมิง พระสังฆานัง
            ทุกขะโรคะภะยัง วิวัญชัยเย สัพพะทุกข์ สัพพะโศก
            สัพพะโรค สัพพะภัย สัพพะเคราะห์ เสนียดจัญไร
            วิวัญชัยเย สัพพะธะนัง สัพพะลาภัง ภะวันตุเม
            รักขันตุ สุรักขันตุ
          </div>
          <br />
          <div>
            อุดรรัสมิง พระพุทธะคุณัง
            อุดรรัสมิง พระธัมเมตัง
            อุดรรัสมิง พระสังฆานัง
            ทุกขะโรคะภะยัง วิวัญชัยเย สัพพะทุกข์ สัพพะโศก
            สัพพะโรค สัพพะภัย สัพพะเคราะห์ เสนียดจัญไร
            วิวัญชัยเย สัพพะธะนัง สัพพะลาภัง ภะวันตุเม
            รักขันตุ สุรักขันตุ
          </div>
          <br />
          <div>

            อิสานรัสมิง พระพุทธะคุณัง
            อิสานรัสมิง พระธัมเมตัง
            อิสานรัสมิง พระสังฆานัง
            ทุกขะโรคะภะยัง วิวัญชัยเย สัพพะทุกข์ สัพพะโศก
            สัพพะโรค สัพพะภัย สัพพะเคราะห์ เสนียดจัญไร
            วิวัญชัยเย สัพพะธะนัง สัพพะลาภัง ภะวันตุเม
            รักขันตุ สุรักขันตุ

          </div>
          <br />
          <div>

            อากาศรัสมิง พระพุทธะคุณัง
            อากาศรัสมิง พระธัมเมตัง
            อากาศรัสมิง พระสังฆานัง
            ทุกขะโรคะภะยัง วิวัญชัยเย สัพพะทุกข์ สัพพะโศก
            สัพพะโรค สัพพะภัย สัพพะเคราะห์ เสนียดจัญไร
            วิวัญชัยเย สัพพะธะนัง สัพพะลาภัง ภะวันตุเม
            รักขันตุ สุรักขันตุ
          </div>
          <br />
          <div>

            ปฐวีรัสมิง พระพุทธะคุณัง
            ปฐวีรัสมิง พระธัมเมตัง
            ปฐวีรัสมิง พระสังฆานัง
            ทุกขะโรคะภะยัง วิวัญชัยเย สัพพะทุกข์ สัพพะโศก
            สัพพะโรค สัพพะภัย สัพพะเคราะห์ เสนียดจัญไร
            วิวัญชัยเย สัพพะธะนัง สัพพะลาภัง ภะวันตุเม
            รักขันตุ สุรักขันตุ
          </div>

        </p>

      </div>

    </div>
  );
};

export default MainForm;
